# Spark API Mini Exercises

#### Copy the code below to create a pandas dataframe with 20 rows and 3 columns:

In [1]:
import pandas as pd
import numpy as np
import pyspark

In [2]:
np.random.seed(13)

pandas_dataframe = pd.DataFrame({
    "n": np.random.randn(20),
    "group": np.random.choice(list("xyz"), 20),
    "abool": np.random.choice([True, False], 20),
})

In [3]:
pandas_dataframe.head()

          n group  abool
0 -0.712391     z  False
1  0.753766     x  False
2 -0.044503     z  False
3  0.451812     y  False
4  1.345102     z  False

### 1. Spark Dataframe Basics

1. Use the starter code above to create a pandas dataframe.
2. Convert the pandas dataframe to a spark dataframe. From this point
   forward, do all of your work with the spark dataframe, not the pandas
   dataframe.
3. Show the first 3 rows of the dataframe.
4. Show the first 7 rows of the dataframe.
5. View a summary of the data using `.describe`.
6. Use `.select` to create a new dataframe with just the `n` and `abool`
   columns. View the first 5 rows of this dataframe.
7. Use `.select` to create a new dataframe with just the `group` and `abool`
   columns. View the first 5 rows of this dataframe.
8. Use `.select` to create a new dataframe with the `group` column and the
   `abool` column renamed to `a_boolean_value`. Show the first 3 rows of
   this dataframe.
9. Use `.select` to create a new dataframe with the `group` column and the
   `n` column renamed to `a_numeric_value`. Show the first 6 rows of this
   dataframe.

In [4]:
spark = pyspark.sql.SparkSession.builder.getOrCreate()

In [5]:
df = spark.createDataFrame(pandas_dataframe)
df

DataFrame[n: double, group: string, abool: boolean]

In [6]:
# First three rows:
df.show(3)

+--------------------+-----+-----+
|                   n|group|abool|
+--------------------+-----+-----+
|  -0.712390662050588|    z|false|
|   0.753766378659703|    x|false|
|-0.04450307833805...|    z|false|
+--------------------+-----+-----+
only showing top 3 rows

In [7]:
# First 7 rows:
df.show(7)

+--------------------+-----+-----+
|                   n|group|abool|
+--------------------+-----+-----+
|  -0.712390662050588|    z|false|
|   0.753766378659703|    x|false|
|-0.04450307833805...|    z|false|
| 0.45181233874578974|    y|false|
|  1.3451017084510097|    z|false|
|  0.5323378882945463|    y|false|
|  1.3501878997225267|    z|false|
+--------------------+-----+-----+
only showing top 7 rows

In [11]:
# Summary using .describe
df.describe()

DataFrame[summary: string, n: string, group: string]

In [12]:
df.describe().show()

+-------+------------------+-----+
|summary|                 n|group|
+-------+------------------+-----+
|  count|                20|   20|
|   mean|0.3664026449885216| null|
| stddev|0.8905322898155363| null|
|    min|-1.261605945319069|    x|
|    max|2.1503829673811126|    z|
+-------+------------------+-----+

In [13]:
# Use .select to create a new dataframe with just the n and abool columns. View the first 5 rows of this dataframe.
df.select(df.n, df.abool).show(5)

+--------------------+-----+
|                   n|abool|
+--------------------+-----+
|  -0.712390662050588|false|
|   0.753766378659703|false|
|-0.04450307833805...|false|
| 0.45181233874578974|false|
|  1.3451017084510097|false|
+--------------------+-----+
only showing top 5 rows

In [14]:
# Use .select to create a new dataframe with just the group and abool columns. View the first 5 rows of this dataframe.
df.select(df.group, df.abool).show(5)

+-----+-----+
|group|abool|
+-----+-----+
|    z|false|
|    x|false|
|    z|false|
|    y|false|
|    z|false|
+-----+-----+
only showing top 5 rows

In [15]:
# Use .select to create a new dataframe with the group column and the abool column renamed to a_boolean_value. 
# Show the first 3 rows of this dataframe.
df.select(df.group, df.abool.alias('a_boolean_value')).show(5)

+-----+---------------+
|group|a_boolean_value|
+-----+---------------+
|    z|          false|
|    x|          false|
|    z|          false|
|    y|          false|
|    z|          false|
+-----+---------------+
only showing top 5 rows

In [18]:
df.show(5)

+--------------------+-----+-----+
|                   n|group|abool|
+--------------------+-----+-----+
|  -0.712390662050588|    z|false|
|   0.753766378659703|    x|false|
|-0.04450307833805...|    z|false|
| 0.45181233874578974|    y|false|
|  1.3451017084510097|    z|false|
+--------------------+-----+-----+
only showing top 5 rows

In [21]:
# Use .select to create a new dataframe with the group column and the n column renamed to a_numeric_value. 
# Show the first 6 rows of this dataframe.
df.select(df.group, df.n).show(5)

+-----+--------------------+
|group|                   n|
+-----+--------------------+
|    z|  -0.712390662050588|
|    x|   0.753766378659703|
|    z|-0.04450307833805...|
|    y| 0.45181233874578974|
|    z|  1.3451017084510097|
+-----+--------------------+
only showing top 5 rows

### Column Manipulation

1. Use the starter code above to re-create a spark dataframe. Store the
   spark dataframe in a varaible named `df`

In [23]:
df.show(5)

+--------------------+-----+-----+
|                   n|group|abool|
+--------------------+-----+-----+
|  -0.712390662050588|    z|false|
|   0.753766378659703|    x|false|
|-0.04450307833805...|    z|false|
| 0.45181233874578974|    y|false|
|  1.3451017084510097|    z|false|
+--------------------+-----+-----+
only showing top 5 rows

2. Use `.select` to add 4 to the `n` column. Show the results.

In [27]:
df.select(df.n, df.n + 4).show(5)

+--------------------+------------------+
|                   n|           (n + 4)|
+--------------------+------------------+
|  -0.712390662050588|3.2876093379494122|
|   0.753766378659703| 4.753766378659703|
|-0.04450307833805...|3.9554969216619464|
| 0.45181233874578974|  4.45181233874579|
|  1.3451017084510097|5.3451017084510095|
+--------------------+------------------+
only showing top 5 rows

3. Subtract 5 from the `n` column and view the results.

In [29]:
df.select(df.n, df.n - 5).show(5)

+--------------------+-------------------+
|                   n|            (n - 5)|
+--------------------+-------------------+
|  -0.712390662050588| -5.712390662050588|
|   0.753766378659703| -4.246233621340297|
|-0.04450307833805...| -5.044503078338053|
| 0.45181233874578974|  -4.54818766125421|
|  1.3451017084510097|-3.6548982915489905|
+--------------------+-------------------+
only showing top 5 rows

4. Multiply the `n` column by 2. View the results along with the original
   numbers.

In [31]:
df.select(df.n, (df.n * 2).alias("n2")).show(5)

+--------------------+--------------------+
|                   n|                  n2|
+--------------------+--------------------+
|  -0.712390662050588|  -1.424781324101176|
|   0.753766378659703|   1.507532757319406|
|-0.04450307833805...|-0.08900615667610691|
| 0.45181233874578974|  0.9036246774915795|
|  1.3451017084510097|  2.6902034169020195|
+--------------------+--------------------+
only showing top 5 rows

5. Add a new column named `n2` that is the `n` value multiplied by -1. Show
   the first 4 rows of your dataframe. You should see the original `n` value
   as well as `n2`.

6. Add a new column named `n3` that is the n value squared. Show the first 5
   rows of your dataframe. You should see both `n`, `n2`, and `n3`.

7. What happens when you run the code below?

    ```python
    df.group + df.abool
    ```

8. What happens when you run the code below? What is the difference between
   this and the previous code sample?

    ```python
    df.select(df.group + df.abool)
    ```

9. Try adding various other columns together. What are the results of
   combining the different data types?

### 1. Type casting

1. Use the starter code above to re-create a spark dataframe.

1. Use `.printSchema` to view the datatypes in your dataframe.

1. Use `.dtypes` to view the datatypes in your dataframe.

1. What is the difference between the two code samples below?

    ```python
    df.abool.cast('int')
    ```

    ```python
    df.select(df.abool.cast('int')).show()
    ```

1. Use `.select` and `.cast` to convert the `abool` column to an integer
   type. View the results.
1. Convert the `group` column to a integer data type and view the results.
   What happens?
1. Convert the `n` column to a integer data type and view the results. What
   happens?
1. Convert the `abool` column to a string data type and view the results.
   What happens?

### 1. Built-in Functions

1. Use the starter code above to re-create a spark dataframe.
1. Import the necessary functions from `pyspark.sql.functions`
1. Find the highest `n` value.
1. Find the lowest `n` value.
1. Find the average `n` value.
1. Use `concat` to change the `group` column to say, e.g. "Group: x" or
   "Group: y"
1. Use `concat` to combine the `n` and `group` columns to produce results
   that look like this: "x: -1.432" or "z: 2.352"

### 1. When / Otherwise

1. Use the starter code above to re-create a spark dataframe.
1. Use `when` and `.otherwise` to create a column that contains the text "It
   is true" when `abool` is true and "It is false"" when `abool` is false.
1. Create a column that contains 0 if n is less than 0, otherwise, the
   original n value.

### 1. Filter / Where

1. Use the starter code above to re-create a spark dataframe.
1. Use `.filter` or `.where` to select just the rows where the group is `y`
   and view the results.
1. Select just the columns where the `abool` column is false and view the
   results.
1. Find the columns where the `group` column is *not* `y`.
1. Find the columns where `n` is positive.
1. Find the columns where `abool` is true and the `group` column is `z`.
1. Find the columns where `abool` is true or the `group` column is `z`.
1. Find the columns where `abool` is false and `n` is less than 1
1. Find the columns where `abool` is false or `n` is less than 1

### 1. Sorting

1. Use the starter code above to re-create a spark dataframe.
1. Sort by the `n` value.
1. Sort by the `group` value, both ascending and descending.
1. Sort by the group value first, then, within each group, sort by `n`
   value.
1. Sort by `abool`, `group`, and `n`. Does it matter in what order you
   specify the columns when sorting?

### 1. Spark SQL

1. Use the starter code above to re-create a spark dataframe.
1. Turn your dataframe into a table that can be queried with spark SQL. Name
   the table `my_df`. Answer the rest of the questions in this section with
   a spark sql query (`spark.sql`) against `my_df`. After each step, view
   the first 7 records from the dataframe.
1. Write a query that shows all of the columns from your dataframe.
1. Write a query that shows just the `n` and `abool` columns from the
   dataframe.
1. Write a query that shows just the `n` and `group` columns. Rename the
   `group` column to `g`.
1. Write a query that selects `n`, and creates two new columns: `n2`, the
   original `n` values halved, and `n3`: the original n values minus 1.
1. What happens if you make a SQL syntax error in your query?

### 1. Aggregating

1. What is the average `n` value for each group in the `group` column?
1. What is the maximum `n` value for each group in the `group` column?
1. What is the minimum `n` value by `abool`?
1. What is the average `n` value for each unique combination of the `group`
   and `abool` column?

---

Revisit the exercises for the [pandas dataframes lesson][1] and [the advanced
dataframes lesson][2]. Complete the exercises, but convert the pandas dataframes
to spark dataframes first in order to practice using the spark api.

[1]: https://ds.codeup.com/python/dataframes/
[2]: https://ds.codeup.com/python/advanced-dataframes/